package ru.job4j.firstprog;

/**
 * 19. Вывод значения переменной с поясняющей надписью.
 * апишите класс, который присваивает переменной х значение 9,
 * а затем выводит на экран:
 * в первой строке ― это значение с поясняющей надписью (например, «значение х равно 9»),
 * а во второй ― квадрат этого значения (тоже с поясняющей надписью).
 */
public class Task19 {
    public static void main(String[] args) {
        int x = 9;
        System.out.println("Значение x равно 9");
        System.out.println("Значение x^2 равно 81");
    }
}
