package ru.job4j.loop;

/**
 * 58. На какое количество двузначных чисел делится число
 * Ниже представлен метод loop(int num), который принимает целое положительное число.
 * <p>
 * Задание: Написать код, который проверяет и выводит в консоль на какое количество
 * целых двузначных чисел от 10 до 20 (оба включительно) делится входящее число.
 * <p>
 * Например, для числа 60 вывод должен быть:
 * <p>
 * 4
 */
public class Task58 {
    public static void loop(int num) {
        int count = 0;
    }
}
