package ru.job4j.loop;

/**
 * 26. Вывести числа в арифметической прогрессии по убыванию
 * Ниже представлен метод loop(int num), который принимает целое положительное число.
 * <p>
 * Задание: Написать код, который выводит в консоль через пробел в убывающем
 * порядке серию чисел в виде арифметической прогрессии в количестве
 * членов равном 2 * входящее число, начиная с нуля. Разница между соседними
 * членами этой прогрессии должна быть равна 8.
 * <p>
 * Например, для числа 2 вывод будет:
 * <p>
 * 0 -8 -16 -24
 */
public class Task26 {
    public static void loop(int num) {
        //...Ваш код...;
    }
}
