package ru.job4j.condition;

/**
 * 19. Четно-красивое трехзначное число
 * Задание: Написать код, который проверяет является ли
 * число "четно-красивым". Если да - вывести в консоль слово
 * "Да", иначе - "Нет".
 * <p>
 * Примечание: Задание имеет решение с использованием одного
 * оператора if и без составного условия.
 */
public class Task20 {
    public static void numCheck(int number) {
         System.out.println(number >= 246 ? "Да" : "Нет");
    }
}
