package ru.job4j.condition;

/**
 * 78. На какие числа из составляющих входящее число цифр оно делится без остатка
 * Ниже представлен метод divWithoutRemainder(int num), который принимает целое положительное трехзначное число.
 * <p>
 * Задание: Написать код, который определяет и выводит в консоль, на какие числа из составляющих входящее число цифр оно делится без остатка. Если
 * таких чисел несколько, то вывести полученные значения через пробел. Если таких чисел нет - вывести "Таких чисел нет".
 * <p>
 * Примечание: Учесть возможность того, что одной из цифр входящего числа может быть ноль.
 * <p>
 * Например, для числа 456 вывод будет:
 * <p>
 * 4 6
 */
public class Task78 {
}
