package ru.job4j.condition;

/**
 * 55. Найти этаж и расположение квартиры
 * Ниже представлен метод apartmentPlace(int number), который принимает целое положительное число.
 * <p>
 * На каждом этаже многоквартирного дома три квартиры. Счет идет слева направо. Например, на первом этаже квартира 1
 * расположена слева, квартира 2 по центру и квартира 3 - справа, и т.д.
 * <p>
 * Задание: Написать код, который находит этаж квартиры, и какое место она занимает на этом этаже. Результат вывести
 * в консоль построчно. Обозначение расположения квартир: 1 - слева, 2 - центр, 3 - справа.
 * <p>
 * Например, для квартиры 12 вывод будет:
 * <p>
 * 4
 * <p>
 * 3
 */
public class Task55 {
    public static void apartmentPlace(int number) {
        //...Ваш код...;
    }
}
