package ru.job4j.condition;

/**
 * 30. Изменить число в зависимости от его знака
 * Ниже представлен метод numModify(int number), который принимает целое число.
 *
 * Задание: Написать код, который делает следующее:
 *
 * - Если число отрицательное, превращает его в положительное.
 *
 * - Если число положительное, превращает его в ноль.
 *
 * - Если ноль, то оставить без изменений.
 *
 * Например, при входящем числе -6 вывод будет:
 *
 * 6
 */
public class Task30 {
    public static void numModify(int number) {

    }
}
