package ru.job4j.condition;

/**
 * 56. Определить возможность существования треугольника по сторонам
 * Ниже представлен метод isTriangle(int a, int b, int c), который принимает 3 целых положительных числа.
 * <p>
 * Задание: Написать код, который проверяет, являются ли эти числа сторонами треугольника, то есть из них возможно
 * составить треугольник.
 * <p>
 * Вывести в консоль "Да", если являются, или "Нет", если не являются.
 * <p>
 * Примечание: Треугольник существует только тогда, когда ни одна из его сторон не превышает сумму двух других.
 * <p>
 * Например, для чисел 7, 2, 2 вывод будет:
 * <p>
 * Нет
 */
public class Task56 {
    public static void isTriangle(int a, int b, int c) {


    }
}
